package edu.shu.styluo.collegeentranceexamination.data.remote.entity;

import java.util.List;

/**
 * 专业查询开设院校entity实体
 * author: styluo
 * date: 2017/4/27 0:13
 * e-mail: shu_jiahuili@foxmail.com
 */

public class CollegeByMajor {

    /**
     * total : 34
     * rows : [{"univ211":"1","univ985":"0","univAddress":"北京市昌平区府学路27号","univAward":null,"univCode":"10053","univCtime":"1952年","univFaculty":null,"univHost":"公办","univIntro":"中国政法大学是一所以法学为主，兼有哲学、经济学、教育学、管理学等多学科的教育部直属全国重点大学。       　　中国政法大学的前身是 1952年成立的由北京大学、燕京大学、辅仁大学、清华大学的法学、政治学、社会学等学科合并组建的北京政法学院，著名法学家、政治学家钱端升先生为首任院长。1983年，在中央 \u201c 要抓紧筹办中国政法大学，把它建成我国政法教育中心 \u201d 的指示下，学院更名为中国政法大学，邓小平同志为大学题写了校名。       　　经过五十多年的建设与发展，学校现已拥有 2个全国人文社科重点研究基地、1个博士后流动站及 18个博士点、 45 个硕士点、17个本科专业。经教育部批准，学校有权自主设置本科专业、自主选拔录取本科生和文体特长生。目前，学校设有法学院、民商经济法学院、国际法学院、刑事司法学院、政治与公共管理学院、商学院、人文学院、外国语学院、继续教育学院、国际教育学院、马克思主义学院、社会学院、法律硕士学院、中美法学院、中德法学院、体育部、现代教育技术中心、科学技术教学部等18个校属院部，有各类在校生20000余名，教职工1700余名，其中专任教师700余名，教授、副教授440余名，博士生导师、硕士生导师300余名。法学教师所从事的教学、研究领域涵盖了法学的所有二级学科。      学校现有学院路和昌平两个校区。学院路校区位于北京市海淀区蓟门桥畔，昌平校区座落在昌平区军都山下。其中，昌平校区于 1985年被列为国家 \u201c 七五 \u201d 重点建设工程。学校现任党委书记是博士生导师石亚军教授，校长是博士生导师徐显明教授。 　　五十多年来，中国政法大学在中央主管部门及社会各界的大力关心支持下，以 \u201c 厚德、明法、格物、致公 \u201d 为校训，以 \u201c 推动中国社会政治进步和法制昌明 \u201d 、建设 \u201c 社会主义法治国家 \u201d 为理想，严谨治学，砥砺人才，在教学、科研和学科建设等各个方面都形成了自己的办学特色，在法学领域具有突出的整体优势，是中国法学教育的重要基地和法学对外交流的中心。 　　中国政法大学是我国高素质政法人才的培养中心，五十多年来，学校共为社会各界输送以政法专业人才为主的各类优秀毕业生 10万余名，其中绝大部分已成为国家公安、检察、审判、司法行政及政府机关、经济实体的骨干力量和法学教学、科研的中坚。 　　中国政法大学是我国重要的法学研究中心。自建校以来，学校在许多专业领域都开创了新中国法学教育的先河，如新中国的第一个法律史专业、第一个民商法专业、第一个经济法专业、第一个诉讼法专业、第一个比较法专业等都溯源于中国政法大学。新中国的第一批法律史学博士也在这里诞生。五十多年来，学校的科研成果不断应用于国家立法和司法实践，从 1954年第一部《中华人民共和国宪法》的起草，到《反分裂国家法》的颁布，共和国每一部重要法律的诞生和实施，无不凝聚着法大人的心血。仅从1978年复办至今，学校就有1000余人次参加了国家主要立法的论证和起草工作。学校目前具有较为完善的科研机构，有两个研究中心，诉讼法研究中心和法制史研究中心，三个研究所，法律古籍整理研究所、人权与人道主义法研究所和比较法研究所，两个学院，中美法学院和中德法学院。      中国政法大学是中国法学与世界交流的中心。改革开放以来，学校与世界 25个国家和地区的50多所大学建立了交流合作关系，目前学校有来自14个国家和地区的留学生400余名。 　　五十多年来，中国政法大学为巩固共和国的政权基础，维护社会稳定，推动政治进步和法治昌明发挥了独特的、不可替代的重要作用，为我国法学教育与研究的创新和发展做出了突出贡献。在共和国建设政治文明和法治国家的社会进程中，中国政法大学具有特殊的历史地位，承担着重要的历史使命。几十年来，学校的创立和发展始终得到了党和国家的 高度重视和亲切关怀。 1983年，中国政法大学创建时，中央就明确指示要 \u201c 把中国政法大学建设成为全国政法教育中心，法学研究中心和法学图书资料信息中心 \u201d ； 1995年和2002年，李岚清副总理两次亲临学校视察，对学校的建设与发展做出高度评价，称 \u201c 中国政法大学是中国法学的最高学府 \u201d ； 2002年，江泽民总书记和李鹏委员长分别为学校建校50周年题词祝贺。国务委员、原教育部部长陈至立同志，出席了50周年庆典大会并发表重要讲话。 2005年4月，全国人大常委会副委员长李铁映同志、教育部部长周济同志等领导莅临我校视察工作，对我校给予了充分肯定。李铁映同志赞扬\u201c中国政法大学是全国人大最得力的助手\u201d。 　　进入 21世纪，在高等教育改革的新形势下，根据\u201c依法治国\u201d方略对法学教育提出的新要求，中国政法大学主动调整发展战略，进一步明确了学校定位和办学目标，提出\u201c以教学为本位、以学生为主体，以人才培养为根本任务，以改革创新为发展动力\u201d的办学理念，规划 用 20年左右的时间，完成全面提升学校的核心竞争力，提高学校的综合办学实力和全面推进学校各项事业的现代化这三大历史任务，在建设法科强校的道路上振兴中国政法大学，把学校建设成多科性、研究型、开放性，特色鲜明的世界知名高水平大学，建设成中国法学教育中心、法学研究中心、法学图书资料信息中心及国家立法与决策咨询服务中心和国际间法律文化交流中心。","univLevel":"本科","univMasters":"68个","univName":"中国政法大学","univNas":"-个","univPhds":"27个","univPhone":"010-58909122","univProvince":"北京","univSchoolmate":null,"univSpecialty":null,"univStudent":"1万~2万人","univSubjection":"教育部","univType":"政法","univWebsite":"http://www.cupl.edu.cn","univWslrank":"133","univXyhrank":"68"},{"univ211":"1","univ985":"1","univAddress":"北京市海淀区中关村南大街27号","univAward":null,"univCode":"10052","univCtime":"1941年","univFaculty":null,"univHost":"公办","univIntro":"中央民族大学是中国少数民族教育的最高学府，是中国少数民族高级人才的摇篮，是中国唯一具有56个民族师生员工的高等学校，是中国民族院校中唯一一所国家\u201c211工程\u201d、\u201c985工程\u201d建设的全国重点大学。校园坐落于胜迹无数、学府林立的北京西郊，南邻国家图书馆，北接著名的中关村高科技园区，环境典雅幽美，人文氛围浓郁，科技信息集中，并于众多名校中自显特色，独具风采。 　　学校前身是1941年10月在延安成立的民族学院。1951年6月11日，中央民族学院正式成立，首任院长是后来担任过国家副主席的乌兰夫。1993年11月30日，中央民族学院更名为中央民族大学。 　　中国三代领导集体都十分关心和重视中央民族大学的建设和发展。建校初期至1966年5月，毛泽东、刘少奇、周恩来、邓小平等国家领导人先后14次接见学校师生代表；改革开放以后，邓小平3次接见师生代表；1993年学校更名时，时任国家主席的江泽民为学校题写了新校名。2001年6月学校50周年校庆之际，时任国务院总理的朱?基到校视察，并代表中央政府提出了\u201c把中央民族大学建成世界一流民族大学\u201d的奋斗目标。2002年6月，国家民委、教育部、北京市人民政府签署了《关于重点共建中央民族大学的协议》，将学校的发展又推上一个新的台阶。 　　经过50多年的建设和开拓，学校现已发展成为以人文社会学科为主体，以民族类学科为特色，文、史、哲、经、管、法、理、工、医、教等学科门类齐全，本科、研究生教育和干部培训并举，民族预科、艺术中专和继续教育等多种办学层次兼有的综合性研究型大学。学校现有18个学院、8个系和1个预科部，有覆盖10个学科门类的67个本科专业，38个硕士学位授权点，17个博士学位授权点，1个国家一级学科博士学位授权点（民族学），2个博士后流动站（民族学、中国少数民族语言文学），2个国家级重点学科（民族学、中国少数民族语言文学），9个省部级重点学科（民族学、中国少数民族语言文学、专门史、马克思主义民族理论与政策、中国少数民族艺术、中国少数民族经济、宗教学、生态学、语言学及应用语言学），2个文科基础学科人才培养和科学研究基地（历史学、中国少数民族语言文学），1个全国普通高校人文社会科学重点科研基地（中国少数民族研究中心）。学校的民族学、中国少数民族语言文学、中国民族史、中国少数民族经济、中国少数民族理论与政策、民族宗教学和中国少数民族艺术等学科具有雄厚的实力和特色优势，不仅在全国居于领先地位，而且具有一定的国际影响。经济、法律、新闻、管理、生命与环境科学、计算机科学与技术等学科也得到快速发展并具有广阔的前景。中央民族大学是中国民族院校中专业设置最多，人才培养层次最高的大学。 　　学校拥有一支高素质、高水平、民族成分众多的师资队伍。学校创立之初，中央政府即从清华大学、北京大学、燕京大学等校选调了一批学界名流到校任教。学校现有正副教授400余名，讲师300余名，他们具有良好的治学传统和学术风范，在教书育人和学术研究上成果卓著。 　　中央民族大学作为中国研究民族问题的重要基地，为国家制定民族政策、解决民族问题做出了重要贡献。早在建校初期，学校的专家、学者就承担和完成了国家交给的一系列重大任务，参与了三次大规模的全国少数民族调查。关于民族识别的调查研究，初步奠定了我国55个少数民族的格局，为国家实行民族区域自治政策提供了依据；关于少数民族社会历史的调查，首次弄清了各少数民族的历史和所处的社会形态，为少数民族地区的社会改革提供了重要依据；关于少数民族语言的调查研究，首次全面了解了我国少数民族语言的状况，并帮助16个少数民族创制和改革了文字。改革开放后，学校有关专家提出的\u201c中华民族多元一体格局理论\u201d，关于加快西部地区发展、缩小东西部差距的建议以及关于西沙南沙考古新发现和关于西藏历史地位等重要科研成果对中国领导部门的宏观决策、中国人文社会科学的发展以及民族地区的繁荣进步都起到了重要作用。 　　中央民族大学每年面向全国各省、市、自治区招生，目前有各类在校生1.3万余名，在全日制本科学生中，70%左右是少数民族。学校堪称中华民族大家庭的缩影和展示中国民族政策以及民族团结进步的重要窗口。56个民族的智慧和文化在校园汇聚一堂，各民族的语言、服饰、歌舞、风习多姿多彩，融汇成了民族团结的交响乐章。良好独特的育人环境和对素质教育的一贯重视，使学校得以向国家和社会输送了大批优秀、合格的建设人才。学校迄今为止已有毕业生6万多名，其中近80人相继走上省、市、自治区以上领导岗位，有的成为了国家领导人；8500多人担任了县以上各级领导职务，成为祖国建设的栋梁之材；更多的毕业生成为专家、学者、作家、诗人、演艺明星或不同领域的优秀人物。 　　学校有较好的教学、科研条件。目前学校占地40多万平方米，各类建筑40余万平方米。2003年新建成的图书馆面积达2.45万平方米，藏书140多万册，其中少数民族文字图书和民族学科文献居中国高校首位，在国内外颇具影响，它还具有先进的设备和阅览、研究等多种现代化功能。学校民族博物馆藏有近3万件珍贵的民族文物可供教学、研究和观摩。学校出版社是全国民族学科教材和著作的出版基地，《中央民族大学学报》和《民族教育研究》是面向国内外发行的全国核心期刊。学校具备首都高校一流的多媒体教学手段，100兆带宽的校园网是电化教学和信息传递的有力保障，数字化校园工程建设已经全面启动。 　　中央民族大学是我国民族高等教育与国际联系的窗口和进行国际学术交流的中心。学校已同50多个国家的大学和研究机构建立了合作与学术交流关系，每年接纳600余名外国留学生来校学习，聘请外国专家来校讲学，并不断选派学生出国留学深造。 　　中央民族大学有着光荣的过去，更有美好的未来。学校正上下一心，为建设世界一流民族大学而努力奋斗。  ","univLevel":"本科","univMasters":"162个","univName":"中央民族大学","univNas":"2个","univPhds":"44个","univPhone":"010-68932902","univProvince":"北京","univSchoolmate":null,"univSpecialty":null,"univStudent":"1万~2万人","univSubjection":"国家民族事务委员会","univType":"民族","univWebsite":"http://www.muc.edu.cn/","univWslrank":"165","univXyhrank":"90"},{"univ211":"1","univ985":"1","univAddress":"北京市海淀区新街口外大街19号","univAward":null,"univCode":"10027","univCtime":"1902年","univFaculty":null,"univHost":"公办","univIntro":"北京师范大学是一所以教师教育、教育科学和文理基础科学为主要特色的著名学府。2002年9月8日，在人民大会堂举行建校100周年庆祝大会。江泽民等党和国家领导同志出席庆祝大会。江泽民同志在会上充分肯定了百年北师大的办学成就，并强调实施科教兴国战略，大力推进教育创新。面向新世纪，北京师范大学确立了建设综合性、有特色、研究型世界知名高水平大学的奋斗目标。 　　 　　100年以前，清末戊戌变法因\u201c需材孔亟\u201d，开启民智，改变中国屡受列强欺凌的状况，在当时中国最高学府和最高教育行政机关的京师大学堂设立了师范馆，成为北京师范大学的前身和中国高等师范教育的发端。百余年的文化积淀，百余年的开拓进取。在一个多世纪的办学历程中，北京师范大学形成了以对祖国未来和民族命运的高度责任感为核心的\u201c爱国进步、诚信质朴、求真创新、为人师表\u201d的优良传统和\u201c学为人师 行为世范\u201d的校训。今天的北京师范大学，学科门类齐全、名师名家荟萃、研究实力雄厚、对外交流广泛、教学质量领先，是国家的重要人才培养基地、学术研究前沿、文化交流窗口和新知识、新思想、新理论的摇篮。北京师范大学以辈出的人才和不斐的实力，稳居全国高校前列。 　　 　　北京师范大学始终坚持以内涵发展为主的道路。本科生教育与研究生教育并重，学校正在以本－研贯通教育体系培养社会和科学发展需要的各类高层次人才。2003年招收本科生2107名，研究生3300名，是我国各类高层次人才的重要培养基地。2003届毕业生中有50%以上继续攻读本校和国内外重点高校和科研机构研究生，其余的毕业生主要进入科研机构、大专院校、政府机关、企事业单位、新闻出版、重点中学等部门工作。人才培养是高校工作的中心，而学科是人才培养的重要基础，学科实力是高素质高水平人才培养的保证。接受高等教育，选好大学重要，选好学科专业更为重要。北京师范大学高度重视学科建设，形成了学科综合、优势突出、特色鲜明的学科新布局。 　　2002年8月，教育部和北京市政府签署了重点共建北师大的协议，北师大成为继北大、清华、复旦、南大等之后第10个列入国家重点建设世界一流大学和知名高水平大学行列的高校。 　　拥有自然科学、人文科学、社会科学、管理科学、教育科学、语言科学、技术科学、新型工程科学等的综合大学。 　　有54个本科专业，127个硕士学位授权点，69个博士学位授权点，14个博士学位授权一级学科，16个博士后流动站，博士点学科数居全国高校前列。 　　教育部首批授予的拥有自主设置本科专业权限的6所大学之一。 　　在2001年全国重点学科评审中，教育学、环境科学名列榜首；系统理论是全国高校同类学科中唯一的重点学科。2003年本科专业排名，中文、教育、心理列全国第一，历史、舞蹈、地理、数学、物理等列全国前位。 　　拥有国家重点学科16个，其中人文科学3个，社会科学6个，理科 6个，工科1个，重点学科总数、重点学科在学校学科中的比例数均居全国高校前列。重点学科有：概率论与数理统计、理论物理、自然地理学、细胞生物学、生态学、系统理论、环境科学、马克思主义哲学、民俗学、教育学原理、教育史、比较教育学、教育技术学、发展与教育心理学、文艺学、中国古代史。 　　拥有中国科学院和中国工程院院士14名：黄祖洽、王梓坤、孙儒泳、刘伯里、刘若庄、刘昌明、张新时、林学钰、李小文、王永炎、陈木法、郑光美、王乃彦、刘鸿亮。 　　资深教授启功、何兹全、赵光贤、陶大镛等在各自的学科领域内造诣深厚，蜚声学林。 　　拥有长江学者奖励计划特聘教授8名，国家级有突出贡献的中青年专家17名，还有近百名优秀中青年学者入选总理基金、百千万工程、跨世纪人才等国家、教育部优秀人才计划。 　　国务院学位委员会委员1人、学科评议组成员13名，居全国高校第6位。 　　全校专任教师1200余人，其中教授373人、副教授521人，具有博士学位的教师占52%。北京师范大学所拥有的一流教学质量和人才培养质量已经受到学术界、国家教育行政部门和社会的肯定。 　　2001年国家级教学成果评奖中，获一等奖2项，二等奖8项，居全国高校第4位；北京市教学成果评奖43项，获奖总数仅次于北京大学、清华大学。 　　有国家文科人才培养基地2个，国家理科人才培养基地5个，国家生命科学与技术人才培养基地1个。国家对外汉语教学人才培养基地1个。 ● 有126个科研及基础教学实验室、11个语言实验室，25个可供学生学习用的计算机房。","univLevel":"本科","univMasters":"166个","univName":"北京师范大学","univNas":"20个","univPhds":"111个","univPhone":"010-58807962","univProvince":"北京","univSchoolmate":null,"univSpecialty":null,"univStudent":"2万~3万人","univSubjection":"教育部","univType":"师范","univWebsite":"http://www.bnu.edu.cn","univWslrank":"22","univXyhrank":"19"},{"univ211":"1","univ985":"0","univAddress":null,"univAward":null,"univCode":"10126","univCtime":null,"univFaculty":null,"univHost":"公办","univIntro":"　　内蒙古大学创建于1957年，是新中国在少数民族省区创立最早的一所综合大学，1978年被教育部确立为国家重点大学，1997年成为国家首批\u201c211工程\u201d重点建设的100所大学之一，2004年成为教育部与内蒙古自治区共建院校，同年被教育部评为本科教学工作优秀院校。是国家大学生创新创业训练计划学校学，中西部高校综合实力提升工程学校。学校位于自治区首府、塞外历史文化名城呼和浩特市。距北京600多公里，空中距离只有440公里，空中飞行时间40分钟，乘火车10个小时。目前，学校占地面积138万平方米，建筑面积71万平方米。 　　党中央、国务院对内蒙古大学的创建和发展给予了高度重视。建校初期熏周恩来总理指示高教部从北京大学等12所高校抽调了一大批优秀教师，组成最初的师资队伍。前国家副主席、当时的国务院副总理、自治区主席乌兰夫兼首任校长，中科院学部委员、著名生物学家、北京大学教授李继侗先生来校执教并担任副校长。中国工程院院士、中国工程院副院长旭日干博士，前自治区副主席连辑先生先后任内蒙古大学校长。现任校长为博士生导师陈国庆教授。 　　1999年1月，中共中央总书记、国家主席江泽民亲临内蒙古大学视察。2003年5月，吴邦国委员长在全国人民抗击非典的重要时刻，再次来到内蒙古大学，带来了党中央、国务院对各民族草原儿女的亲切关怀。2004年1月，贾庆林主席来到内蒙古大学视察并看望了学校师生。十五、十六届政治局常委李岚清、曾庆红等同志也先后到内蒙古大学视察。 　　经过半个多世纪的发展，内蒙古大学已经形成\u201c立足边疆、面向全国、育人为本、特色强校\u201d的办学理念、\u201c求真务实\u201d的校训、\u201c团结、严谨、求实、奋进\u201d的校风和\u201c崇尚真知、追求卓越\u201d的内大精神。 　　内蒙古大学拥有一支师德高尚、学风严谨、业务素质较高的师资队伍。现有在职教职工2844人，其中教学科研人员1697人，博士生导师128人，教授267人，副教授470人；教学科研人员中具有博士学位的占30.1%。有中国工程院院士1人，全国\u201c杰出专业技术人才\u201d称号2人，教育部\u201c长江学者奖励计划\u201d特聘教授1人，双聘院士5人，国家有突出贡献的中青年专家8人，享受国务院政府特殊津贴专家71人，入选国家\u201c百千万人才工程\u201d5人，教育部\u201c新世纪优秀人才支持计划\u201d11人。内蒙古杰出人才奖9人，自治区有突出贡献的中青年专家41人，入选自治区\u201c新世纪321人才工程\u201d2012年人选一层次13人、二层次39人，入选自治区\u201c草原英才\u201d工程培养人才人选32人、刚性引进人才人选12人。 　　内蒙古大学设有蒙古学学院、民族学与社会学学院、文学与新闻传播学院、历史与旅游文化学院、哲学学院、经济管理学院、法学院、外国语学院、公共管理学院、数学科学学院、物理科学与技术学院、化学化工学院、生命科学学院、环境与资源学院、电子信息工程学院、计算机学院、软件学院、交通学院、艺术学院、鄂尔多斯学院、满洲里学院、继续教育学院、国际教育学院、研究生院等24个学院和蒙古历史学系，另外还设有教育部正式批准成立的内蒙古大学创业学院（独立学院）。设有78个本科专业，开设13个本科双学士学位专业。 　　学校现有7个一级学科博士学位授权点，有49个二级学科博士学位授权点，26个一级学科硕士学位授权点，139个二级学科硕士学位授权点（含9个硕士专业学位授权点），6个博士后科研流动站，２个国家重点学科，１个国家级重点培育学科，18个自治区级重点学科，8个自治区级重点培育学科，１个教育部人文社会科学重点研究基地，5个省级人文社会科学重点研究基地，2个省部共建国家重点实验室培育基地，3个部级重点实验室，2个教育部工程研究中心，17个省级重点实验室（工程技术研究中心），１个国家级实验教学示范中心，9个自治区级实验教学示范中心，4个国家级教学团队，15个自治区级教学团队，2个国家级人才培养模式创新实验区。有3名国家级教学名师，17名自治区级教学名师，6门国家级精品课，3门国家级视频公开课，1门国家级资源共享课,2门国家双语教学示范课程，65门自治区级精品课，8个国家级特色专业，43个自治区级品牌专业，1个国家级专业综合改革试点。有蒙古语言文学、数理学、生物学、生命科学与技术４个国家基础科学研究和教学人才培养基地，1个国家级卓越法律和人才教育基地,学校与内蒙古工业大学、内蒙古农业大学共同建设国家大学生文化素质教育基地，化学、文史哲２个自治区基础科学研究和教学人才培养基地。具有哲学、经济学、法学、文学（汉语言文学、蒙古语言文学、外语类）、历史学、理学、工学、农学、管理学、艺术学等门类齐全的学科专业体系。 　　内蒙古大学以本科和研究生教育为主，有本科、硕士、博士等多种办学层次。学校还招收民族预科生和留学生。目前各类在校生约20000人，蒙古族及其他少数民族学生约占总数的30％。建校以来，累计培养各类人才8万余人，其中，有4人已成为中国科学院、中国工程院院士，有20多人成为省部级以上领导，一批毕业生已成为各行业高层次管理人才和杰出的学科带头人。 　　学校坚持教学、科研并重，教学、科研、社会服务、国际交流与合作四位一体的办学原则，积极承担国家和自治区的各级各类科研项目取得了显著的成绩。蒙古学、草地生态学、生殖生物学与生物技术等研究成果熏在国内外享有盛誉，具有鲜明的民族特色和地区特色。多项教学、科研成果获得国家级、省部级奖励。 　　1996年内蒙古大学网络中心进入中国教育科研网（ＣＥＲＮＥＴ），是ＣＥＲＮＥＴ的西部中心结点之一。学校计算中心可以同时容纳1000名学生上机（每人一台计算机）。现代化的电教中心于1998年建成并投入使用熏目前所有教室均为多媒体教室。 　　内蒙古大学图书馆是自治区最大的文献信息中心之一，有蒙、汉、满、藏以及外文图书220余万册，是CALIS中心的B级成员馆，是内蒙古高等教育文献保障系统（NALIS）的中心馆。 　　1997年落成的现代化多功能文体活动中心，造型奇伟、设施一流、功能多样熏是开展文艺、体育活动的理想场所，包括中央电视台的许多名牌栏目都曾在这里录制节目。 　　近年来，内蒙古大学新建了数座学生公寓。本科生达到４-6人一间，有电视、电话和互联网接口。理工楼和化学化工楼的建成，特别是内蒙古大学南校区2009年投入使用，九个学院顺利搬迁，极大地改善了我校办学条件，我校已拥有国内一流的教学环境。 　　学校积极开展与国内外高等院校、科研机构和学术团体的学术交流与合作。改革开放以来，先后与国外许多所高校建立了交流与合作关系，举办了多次国际学术会议和全国性学术会议，每年都有学者来校进行学术访问和学术交流。学校还有计划地安排了教师出国留学、进行学术访问，取得了良好效果。 　　在50多年的发展过程中，内蒙古大学实现了从普通高等学校到全国重点大学、从一般性建设院校到\u201c211工程\u201d重点建设院校、从地方性大学到省（自治区）部共建大学三次历史性跨越，日益成为祖国北部边疆地区高素质人才培养、高水平科学研究、高质量成果转化和高层次决策咨询的重要基地，为科教兴国、人才强国，为国家和内蒙古自治区经济发展、文化繁荣和社会进步作出越来越大的贡献。 　　学校不断深化教育、教学改革熏努力提高办学水平、办学质量和办学效益，力争使内蒙古大学的整体办学实力和办学水平在全国同类大学中处于前列，部分重点学科教学科研水平达到国内乃至世界领先水平，成为在国内外有一定影响的具有鲜明民族特色和地区特色的高水平教学研究型大学。","univLevel":"本科/高职(专科)","univMasters":null,"univName":"内蒙古大学","univNas":null,"univPhds":null,"univPhone":null,"univProvince":"内蒙古","univSchoolmate":null,"univSpecialty":null,"univStudent":null,"univSubjection":"内蒙古自治区教育厅","univType":"综合","univWebsite":"http://www.imu.edu.cn/","univWslrank":"173","univXyhrank":null},{"univ211":"1","univ985":"0","univAddress":"沈阳市皇姑区崇山中路66号","univAward":null,"univCode":"10140","univCtime":"1948年","univFaculty":null,"univHost":"公办","univIntro":"　　经过半个多世纪的不懈努力，辽宁大学已经成为一所具备文、史、哲、经、法、理、工、管、艺等多学科的辽宁省惟一的综合性大学。学校现有三个校区，即沈阳崇山校区、沈阳蒲河校区和辽阳武圣校区，教学区占地面积2196亩，建筑面积64.45万平方米，是国家\u201c211工程\u201d重点建设院校之一。 　　辽宁大学初创于1948年11月东北人民政府在沈阳建立的商业专门学校，建校之初即招收四年制本科生。1958年9月15日，东北财经学院、沈阳师范学院和沈阳俄文专科学校合并，组建成辽宁大学，朱德同志亲笔题写了校名。 　　学校设有25个学院，即文学院、历史学院、哲学与公共管理学院、经济学院、商学院、法学院、外国语学院、广播影视学院、国际关系学院、马克思主义学院、亚澳商学院、新华国际商学院、本山艺术学院、数学院、物理学院、化学院、药学院、生命科学院、环境学院、信息学院、轻型产业学院、人文科技学院、国际教育学院、成人教育学院/继续教育学院、公共基础学院. 　　学校现有专任教师1255人，其中教授281人、副教授476人，博士生导师99人，享受国务院政府特殊津贴专家83人，长江学者特聘教授2人，双聘院士1人。 学校现有本科专业69个；一级学科硕士学位授权点26个，二级学科硕士学位授权点158个，其中设有EMBA（高级管理人员工商管理硕士）、MBA（工商管理硕士）、MPA（公共管理硕士）、JM（法律硕士）、MTCSOL（汉语国际教育硕士）、MFA（艺术硕士）等21个专业学位授权点；现有理论经济学、应用经济学、工商管理、中国语言文学、哲学、法学、化学和统计学等8个一级学科博士学位授权点，具有二级学科博士学位授权点66个，有6个博士后流动站；设有世界经济、国民经济学和金融学3个国家重点学科、6个省重点一级学科；设有国家经济学基础人才培养基地、高校辅导员培训与研修基地和教育部人文社会科学重点研究基地\u2014\u2014转型国家经济政治研究中心、辽宁大学\u2014澳门城市大学澳门社会经济发展研究中心。学校有2个国家级实验教学示范中心、6个省级人文社科重点研究基地、8个省级重点实验室、3个省级工程技术研究中心、1个省级工程实验室、6个省级实验教学示范中心、6个中央与地方共建高校特色优势学科实验室、12个中央财政支持地方高校教学实验平台、6个省高等学校创新团队。截止2014年4月，学校有全日制在校学生2.8万余人，其中本科生近2万人，研究生7000余人，外国留学生1000余人。 　　学校现有校舍建筑面积64.45万平方米，各类实验教学中心（室）28个，实习基地125个，教学科研仪器设备总值22564万元。公共服务体系建设较为完善，图书馆总面积达4.2万平方米，馆藏文献277.5万册，其中珍本、善本书300余种，被联合国出版部指定为联合国文献收藏图书馆，是国务院批准的\u201c全国古籍重点保护单位\u201d。学校设有历史博物馆、自然博物馆，珍藏2000余件文物和1.6万多号生物标本。校园网是中国教育和科研网的组成部分，已成为沈阳北部大学区域节点。 　　自建校以来，辽宁大学已为国家培养各类学生15万余人，为美国、日本、俄罗斯、韩国、意大利、英国、法国等94个国家培养长期留学生8000余人，短期留学生3000余人。学校分别与俄罗斯伊尔库茨克国立大学、立陶宛维尔纽斯大学、塞内加尔达喀尔大学共建孔子学院，精心打造的孔子学院品牌跨越亚、欧、非三大洲，国际化办学步入全新的发展阶段。 　　面对21世纪社会发展、时代进步的要求，辽宁大学秉承\u201c明德精学、笃行致强\u201d的校训精神，力争经过全体辽大人的扎实工作，早日把辽宁大学建设成为人才培养质量上乘、学科建设特色鲜明，整体办学实力国内先进、具有重要国际影响的高水平大学。","univLevel":"本科","univMasters":"190个","univName":"辽宁大学","univNas":"1个","univPhds":"76个","univPhone":"024-62202299","univProvince":"辽宁","univSchoolmate":null,"univSpecialty":null,"univStudent":"2万~3万人","univSubjection":"辽宁省教育厅","univType":"综合","univWebsite":"http://www.lnu.edu.cn/","univWslrank":"169","univXyhrank":null}]
     */

    private int total;
    private List<RowsBean> rows;

    public int getTotal() {
        return total;
    }

    public void setTotal(int total) {
        this.total = total;
    }

    public List<RowsBean> getRows() {
        return rows;
    }

    public void setRows(List<RowsBean> rows) {
        this.rows = rows;
    }

    public static class RowsBean {
        /**
         * univ211 : 1
         * univ985 : 0
         * univAddress : 北京市昌平区府学路27号
         * univAward : null
         * univCode : 10053
         * univCtime : 1952年
         * univFaculty : null
         * univHost : 公办
         * univIntro : 中国政法大学是一所以法学为主，兼有哲学、经济学、教育学、管理学等多学科的教育部直属全国重点大学。       　　中国政法大学的前身是 1952年成立的由北京大学、燕京大学、辅仁大学、清华大学的法学、政治学、社会学等学科合并组建的北京政法学院，著名法学家、政治学家钱端升先生为首任院长。1983年，在中央 “ 要抓紧筹办中国政法大学，把它建成我国政法教育中心 ” 的指示下，学院更名为中国政法大学，邓小平同志为大学题写了校名。       　　经过五十多年的建设与发展，学校现已拥有 2个全国人文社科重点研究基地、1个博士后流动站及 18个博士点、 45 个硕士点、17个本科专业。经教育部批准，学校有权自主设置本科专业、自主选拔录取本科生和文体特长生。目前，学校设有法学院、民商经济法学院、国际法学院、刑事司法学院、政治与公共管理学院、商学院、人文学院、外国语学院、继续教育学院、国际教育学院、马克思主义学院、社会学院、法律硕士学院、中美法学院、中德法学院、体育部、现代教育技术中心、科学技术教学部等18个校属院部，有各类在校生20000余名，教职工1700余名，其中专任教师700余名，教授、副教授440余名，博士生导师、硕士生导师300余名。法学教师所从事的教学、研究领域涵盖了法学的所有二级学科。      学校现有学院路和昌平两个校区。学院路校区位于北京市海淀区蓟门桥畔，昌平校区座落在昌平区军都山下。其中，昌平校区于 1985年被列为国家 “ 七五 ” 重点建设工程。学校现任党委书记是博士生导师石亚军教授，校长是博士生导师徐显明教授。 　　五十多年来，中国政法大学在中央主管部门及社会各界的大力关心支持下，以 “ 厚德、明法、格物、致公 ” 为校训，以 “ 推动中国社会政治进步和法制昌明 ” 、建设 “ 社会主义法治国家 ” 为理想，严谨治学，砥砺人才，在教学、科研和学科建设等各个方面都形成了自己的办学特色，在法学领域具有突出的整体优势，是中国法学教育的重要基地和法学对外交流的中心。 　　中国政法大学是我国高素质政法人才的培养中心，五十多年来，学校共为社会各界输送以政法专业人才为主的各类优秀毕业生 10万余名，其中绝大部分已成为国家公安、检察、审判、司法行政及政府机关、经济实体的骨干力量和法学教学、科研的中坚。 　　中国政法大学是我国重要的法学研究中心。自建校以来，学校在许多专业领域都开创了新中国法学教育的先河，如新中国的第一个法律史专业、第一个民商法专业、第一个经济法专业、第一个诉讼法专业、第一个比较法专业等都溯源于中国政法大学。新中国的第一批法律史学博士也在这里诞生。五十多年来，学校的科研成果不断应用于国家立法和司法实践，从 1954年第一部《中华人民共和国宪法》的起草，到《反分裂国家法》的颁布，共和国每一部重要法律的诞生和实施，无不凝聚着法大人的心血。仅从1978年复办至今，学校就有1000余人次参加了国家主要立法的论证和起草工作。学校目前具有较为完善的科研机构，有两个研究中心，诉讼法研究中心和法制史研究中心，三个研究所，法律古籍整理研究所、人权与人道主义法研究所和比较法研究所，两个学院，中美法学院和中德法学院。      中国政法大学是中国法学与世界交流的中心。改革开放以来，学校与世界 25个国家和地区的50多所大学建立了交流合作关系，目前学校有来自14个国家和地区的留学生400余名。 　　五十多年来，中国政法大学为巩固共和国的政权基础，维护社会稳定，推动政治进步和法治昌明发挥了独特的、不可替代的重要作用，为我国法学教育与研究的创新和发展做出了突出贡献。在共和国建设政治文明和法治国家的社会进程中，中国政法大学具有特殊的历史地位，承担着重要的历史使命。几十年来，学校的创立和发展始终得到了党和国家的 高度重视和亲切关怀。 1983年，中国政法大学创建时，中央就明确指示要 “ 把中国政法大学建设成为全国政法教育中心，法学研究中心和法学图书资料信息中心 ” ； 1995年和2002年，李岚清副总理两次亲临学校视察，对学校的建设与发展做出高度评价，称 “ 中国政法大学是中国法学的最高学府 ” ； 2002年，江泽民总书记和李鹏委员长分别为学校建校50周年题词祝贺。国务委员、原教育部部长陈至立同志，出席了50周年庆典大会并发表重要讲话。 2005年4月，全国人大常委会副委员长李铁映同志、教育部部长周济同志等领导莅临我校视察工作，对我校给予了充分肯定。李铁映同志赞扬“中国政法大学是全国人大最得力的助手”。 　　进入 21世纪，在高等教育改革的新形势下，根据“依法治国”方略对法学教育提出的新要求，中国政法大学主动调整发展战略，进一步明确了学校定位和办学目标，提出“以教学为本位、以学生为主体，以人才培养为根本任务，以改革创新为发展动力”的办学理念，规划 用 20年左右的时间，完成全面提升学校的核心竞争力，提高学校的综合办学实力和全面推进学校各项事业的现代化这三大历史任务，在建设法科强校的道路上振兴中国政法大学，把学校建设成多科性、研究型、开放性，特色鲜明的世界知名高水平大学，建设成中国法学教育中心、法学研究中心、法学图书资料信息中心及国家立法与决策咨询服务中心和国际间法律文化交流中心。
         * univLevel : 本科
         * univMasters : 68个
         * univName : 中国政法大学
         * univNas : -个
         * univPhds : 27个
         * univPhone : 010-58909122
         * univProvince : 北京
         * univSchoolmate : null
         * univSpecialty : null
         * univStudent : 1万~2万人
         * univSubjection : 教育部
         * univType : 政法
         * univWebsite : http://www.cupl.edu.cn
         * univWslrank : 133
         * univXyhrank : 68
         */

        private String univ211;
        private String univ985;
        private String univAddress;
        private Object univAward;
        private String univCode;
        private String univCtime;
        private Object univFaculty;
        private String univHost;
        private String univIntro;
        private String univLevel;
        private String univMasters;
        private String univName;
        private String univNas;
        private String univPhds;
        private String univPhone;
        private String univProvince;
        private Object univSchoolmate;
        private Object univSpecialty;
        private String univStudent;
        private String univSubjection;
        private String univType;
        private String univWebsite;
        private String univWslrank;
        private String univXyhrank;

        public String getUniv211() {
            return univ211;
        }

        public void setUniv211(String univ211) {
            this.univ211 = univ211;
        }

        public String getUniv985() {
            return univ985;
        }

        public void setUniv985(String univ985) {
            this.univ985 = univ985;
        }

        public String getUnivAddress() {
            return univAddress;
        }

        public void setUnivAddress(String univAddress) {
            this.univAddress = univAddress;
        }

        public Object getUnivAward() {
            return univAward;
        }

        public void setUnivAward(Object univAward) {
            this.univAward = univAward;
        }

        public String getUnivCode() {
            return univCode;
        }

        public void setUnivCode(String univCode) {
            this.univCode = univCode;
        }

        public String getUnivCtime() {
            return univCtime;
        }

        public void setUnivCtime(String univCtime) {
            this.univCtime = univCtime;
        }

        public Object getUnivFaculty() {
            return univFaculty;
        }

        public void setUnivFaculty(Object univFaculty) {
            this.univFaculty = univFaculty;
        }

        public String getUnivHost() {
            return univHost;
        }

        public void setUnivHost(String univHost) {
            this.univHost = univHost;
        }

        public String getUnivIntro() {
            return univIntro;
        }

        public void setUnivIntro(String univIntro) {
            this.univIntro = univIntro;
        }

        public String getUnivLevel() {
            return univLevel;
        }

        public void setUnivLevel(String univLevel) {
            this.univLevel = univLevel;
        }

        public String getUnivMasters() {
            return univMasters;
        }

        public void setUnivMasters(String univMasters) {
            this.univMasters = univMasters;
        }

        public String getUnivName() {
            return univName;
        }

        public void setUnivName(String univName) {
            this.univName = univName;
        }

        public String getUnivNas() {
            return univNas;
        }

        public void setUnivNas(String univNas) {
            this.univNas = univNas;
        }

        public String getUnivPhds() {
            return univPhds;
        }

        public void setUnivPhds(String univPhds) {
            this.univPhds = univPhds;
        }

        public String getUnivPhone() {
            return univPhone;
        }

        public void setUnivPhone(String univPhone) {
            this.univPhone = univPhone;
        }

        public String getUnivProvince() {
            return univProvince;
        }

        public void setUnivProvince(String univProvince) {
            this.univProvince = univProvince;
        }

        public Object getUnivSchoolmate() {
            return univSchoolmate;
        }

        public void setUnivSchoolmate(Object univSchoolmate) {
            this.univSchoolmate = univSchoolmate;
        }

        public Object getUnivSpecialty() {
            return univSpecialty;
        }

        public void setUnivSpecialty(Object univSpecialty) {
            this.univSpecialty = univSpecialty;
        }

        public String getUnivStudent() {
            return univStudent;
        }

        public void setUnivStudent(String univStudent) {
            this.univStudent = univStudent;
        }

        public String getUnivSubjection() {
            return univSubjection;
        }

        public void setUnivSubjection(String univSubjection) {
            this.univSubjection = univSubjection;
        }

        public String getUnivType() {
            return univType;
        }

        public void setUnivType(String univType) {
            this.univType = univType;
        }

        public String getUnivWebsite() {
            return univWebsite;
        }

        public void setUnivWebsite(String univWebsite) {
            this.univWebsite = univWebsite;
        }

        public String getUnivWslrank() {
            return univWslrank;
        }

        public void setUnivWslrank(String univWslrank) {
            this.univWslrank = univWslrank;
        }

        public String getUnivXyhrank() {
            return univXyhrank;
        }

        public void setUnivXyhrank(String univXyhrank) {
            this.univXyhrank = univXyhrank;
        }
    }
}
